#Область ПрограммныйИнтерфейс

#Область СервисКэшированияНастроек

// Получает ранее записанное значение из кэша или неопределено если значение в кэше не обнаружено
//
// Параметры:
//  Контур	 - Строка - Идентификатор контура
//  Ключ	 - Перечисление.КШДЯдроКлючиКэшаНастроек - Ключ записываемых настроек
// 
// Возвращаемое значение:
//  Произвольный - Значение, сохраненное в кеше
//
Функция ЗначениеИзКэша(Контур, Ключ) Экспорт
	СтруктураОтбора = Новый Структура("Контур, Ключ", Контур, Ключ);
	КэшированныеДанные = РегистрыСведений.КШДЯдроКэшНастроек.Получить(СтруктураОтбора);
	
	Если Не ЗначениеЗаполнено(КэшированныеДанные.ТипЗначения) Тогда
		//Данных к кеше нет
		Возврат Неопределено;
	КонецЕсли;
	
	Если КэшированныеДанные.ТипЗначения = Перечисления.КШДЯдроТипыХранимыхЗначений.Число Тогда
		Возврат КэшированныеДанные.Число;
	ИначеЕсли КэшированныеДанные.ТипЗначения = Перечисления.КШДЯдроТипыХранимыхЗначений.Строка Тогда
		Возврат КэшированныеДанные.Строка;
	ИначеЕсли КэшированныеДанные.ТипЗначения = Перечисления.КШДЯдроТипыХранимыхЗначений.Дата Тогда
		Возврат КэшированныеДанные.Дата;
	ИначеЕсли КэшированныеДанные.ТипЗначения = Перечисления.КШДЯдроТипыХранимыхЗначений.Булево Тогда
		Возврат КэшированныеДанные.Булево;
	Иначе
		Возврат КэшированныеДанные.Прочее.Получить();
	КонецЕсли;
КонецФункции
	
#КонецОбласти

#КонецОбласти
