///////////////////////////////////////////////////////////////////////////////////////////////////////////////////////
//	Библиотека работы с Git.                                                                                         //
//	Для работы требуется библиотека работы с безопасным хранилищем (общий модуль SDS_ОбщегоНазначения),              // 
//	либо использование БСП при условии замены в коде вызовов"SDS_ОбщегоНазначения" на "ОбщегоНазначения".            //
///////////////////////////////////////////////////////////////////////////////////////////////////////////////////////

#Область ПрограммныйИнтерфейс
// Возвращает строку соединения для подключения к Git.
//
// Параметры:
//  Настройка   - СправочникСсылка.Git_НастройкиРепозиториев
// 
// Возвращаемое значение:
//  Строка
Функция ПолучитьСтрокуСоединения(Настройка) Экспорт 

	СтрокаАвторизации = "";
	Если Настройка.СпособАвторизации = Перечисления.Git_СпособыАвторизации.OAuth Тогда
		УстановитьПривилегированныйРежим(Истина);
		ДанныеАвторизации = SDS_ОбщегоНазначения.ПрочитатьДанныеИзБезопасногоХранилища(Настройка, "Токен");
		УстановитьПривилегированныйРежим(Ложь); 
		Если Не ДанныеАвторизации = Неопределено Тогда
			СтрокаАвторизации = "" + ДанныеАвторизации + "@";		
		КонецЕсли;
	ИначеЕсли Настройка.СпособАвторизации = Перечисления.Git_СпособыАвторизации.ПоПаролю Тогда
		УстановитьПривилегированныйРежим(Истина);
		ДанныеАвторизации = SDS_ОбщегоНазначения.ПрочитатьДанныеИзБезопасногоХранилища(Настройка, "Логин, Пароль"); 
		УстановитьПривилегированныйРежим(Ложь);
		Если Не ДанныеАвторизации = Неопределено Тогда
			СтрокаАвторизации = "" + ДанныеАвторизации.Логин + ":" + ДанныеАвторизации.Пароль + "@";		
		КонецЕсли;
	КонецЕсли; 
	
	Возврат Строка(Настройка.ПротоколСоединения) + СтрокаАвторизации + Настройка.ПутьКРепозиторию + ".git";
	
КонецФункции
#КонецОбласти 
