#Область ПрограммныйИнтерфейс

#Область СервисСервисыУзла

// Возвращает массив всех сервисов, поддерживаемых узлом
// 
// Возвращаемое значение:
//  Массив Из Структура:
//		* Идентификатор - Строка - Уникальный идентификатор сервиса (не меняется, задается фиксированным значением)
//		* Наименование - Строка - Наименование сервиса
//		* Метод - Строка - Метод сервиса, который будет вызываться при получении сообщения для него
//		* КоличествоПотоков - Число - Количество потоков выполнения вызывов по умолчанию
//		* Включен - Булево - Признак состояния сервиса при первичном добавлении
//
Функция СервисыТекущегоУзла() Экспорт
	
	МассивСервисов = Новый Массив;
	
	//Тестовый сервис удалить при внедрении
	ОписаниеСервиса = Новый Структура;
	ОписаниеСервиса.Вставить("Идентификатор", "6cbf4a3d-ab83-4223-ba74-653ad0003b71");
	ОписаниеСервиса.Вставить("Наименование", "Демо сервис");
	ОписаниеСервиса.Вставить("Метод", "КШДДемоСервис.ОбработатьВходящийПакет");
	ОписаниеСервиса.Вставить("КоличествоПотоков", 1); //Значение по умолчанию
	ОписаниеСервиса.Вставить("Включен", Ложь); //Значение по умолчанию
	
	МассивСервисов.Добавить(ОписаниеСервиса);
	//Конец описания тестового сервера
	
	Возврат МассивСервисов;
	
КонецФункции

#КонецОбласти

#КонецОбласти
