
#Область ОбработчикиСобытий

Процедура ПередЗаписью(Отказ)
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	ВРаботе = (Состояние = Перечисления.СостоянияКонтуров.ВРаботе);
	ПредыдущееЧерновик = (Не ЗначениеЗаполнено(Ссылка) ИЛИ Ссылка.Состояние = Перечисления.СостоянияКонтуров.Черновик);
	КонтурРазработки = (ТипКонтура = Перечисления.ТипыКонтуров.Разработка);
	
	Если ВРаботе И ПредыдущееЧерновик И КонтурРазработки Тогда
		Этап = Справочники.ЭтапыКонтуров.Регистрация;
	КонецЕсли;
КонецПроцедуры

#КонецОбласти
