
#Область ПрограммныйИнтерфейс

// По значению перечисления возвращает его имя, как задано в конфигураторе
//
// Параметры:
//  ПеречислениеСсылка - ПеречислениеСсылка - ссылка на произвольное значение перечисления
//
// Возвращаемое значение:
//  Строка - Имя перечисления
//
Функция ПолучитьИмяПеречисления(Знач ПеречислениеСсылка) Экспорт
	ИмяМетаданных = ПеречислениеСсылка.Метаданные().Имя;
	НазваниеМенеджера = "ПеречислениеМенеджер." + ИмяМетаданных;    
	Менеджер = Новый (НазваниеМенеджера); 
	Имя = ПеречислениеСсылка.Метаданные().ЗначенияПеречисления[Менеджер.Индекс(ПеречислениеСсылка)].Имя;
	Возврат Имя;  
КонецФункции

#КонецОбласти
