#Область ПрограммныйИнтерфейс

// Получает список обработчиков, которые ранее не выполнялись при обновлении данных
//
// Возвращаемое значение:
//  Массив из Структура:
//		* Обработчик - Строка - Имя модуля и процедуры
//		* Параметры - Массив из Произвольный
//
Функция ПолучитьСписокОбработчиков() Экспорт
	МассивОбработчиков = Новый Массив;
	
	СтруктураОбработчика = Новый Структура;
	СтруктураОбработчика.Вставить("Обработчик", 
		"ОбработчикиОбновленияСервер.ОбновитьПорядокПредопределенныхЭтаповКонтуров");
	СтруктураОбработчика.Вставить("Параметры", Новый Массив);
	МассивОбработчиков.Добавить(СтруктураОбработчика);
	
	Возврат МассивОбработчиков;
КонецФункции

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

Процедура ОбновитьПорядокПредопределенныхЭтаповКонтуров() Экспорт
	Выборка = Справочники.ЭтапыКонтуров.Выбрать();
	Пока Выборка.Следующий() Цикл
		ТекЭтап = Выборка.ПолучитьОбъект();
		ТекЭтап.Порядок = Число(Выборка.Код);
		ТекЭтап.Записать();
	КонецЦикла;
КонецПроцедуры

#КонецОбласти
