#Область ПрограммныйИнтерфейс
// Возвращает данные из безопасного хранилища.
//
// Параметры:
// 	Владелец   - ПланОбменаСсылка, СправочникСсылка, Строка - ссылка на объект информационной базы,
//                  представляющий объект-владелец сохраняемого пароля или строка до 128 символов.
// 	Ключи       - Строка - содержит список имен сохраненных данных, указанных через запятую.
// 
// Возвращаемое значение:
//  Произвольный, Структура, Неопределенно - данные из безопасного хранилища. Если указан один ключ,
//                            то возвращается его значение, иначе структура.
//                            Если данные отсутствуют - Неопределенно.
Функция ПрочитатьДанныеИзБезопасногоХранилища(Владелец, Ключи = "Пароль") Экспорт 
	Возврат ОбщегоНазначения.ПрочитатьДанныеИзБезопасногоХранилища(Владелец, Ключи);	
КонецФункции 

// Записывает конфиденциальные данные в безопасное хранилище.
//
// Параметры:
//  Владелец	- СправочникСсылка - Ссылка на объект информационной базы, представляющий объект-владелец сохраняемого
//									пароля или строка до 128 символов.
//  Данные		- Произвольный - данные помещаемые в безопасное хранилище. Неопределенно - удаляет все данные.
//  Ключ    	- Строка - ключ сохраняемых настроек, по умолчанию "Пароль".
Процедура ЗаписатьДанныеВБезопасноеХранилище(Владелец, Данные,  Ключ = "Пароль") Экспорт 
	ОбщегоНазначения.ЗаписатьДанныеВБезопасноеХранилище(Владелец, Данные,  Ключ);	
КонецПроцедуры 

// Удаляет конфиденциальные данные из безопасного хранилища.
//
// Параметры:
//  Владелец - ПланОбменаСсылка, СправочникСсылка, Строка - ссылка на объект информационной базы,
//               представляющий объект-владелец сохраняемого пароля или строка до 128 символов.
//  Ключи    - Строка - содержит список имен удаляемых данных, указанных через запятую. 
//               Неопределено - удаляет все данные.
Процедура УдалитьДанныеИзБезопасногоХранилища(Владелец, Ключи = Неопределено) Экспорт	
	ОбщегоНазначения.УдалитьДанныеИзБезопасногоХранилища(Владелец, Ключи);		
КонецПроцедуры

#КонецОбласти